Revit 2024 API
StairsRunType.TotalDepth Property
 The total depth of the stairs run, only available for monolithic stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double TotalDepth { get; }
Visual Basic
Public ReadOnly Property TotalDepth As Double
	Get
Visual C++
public:
property double TotalDepth {
	double get ();
}
See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace